zheleznovkiril/2k22-home-led/stm32f103/KURSACH/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BUTTON_Pin GPIO_PIN_0
#define BUTTON_GPIO_Port GPIOB
#define BUTTON_EXTI_IRQn EXTI0_IRQn
#define FOUR_CT_Pin GPIO_PIN_12
#define FOUR_CT_GPIO_Port GPIOB
#define THREE_CT_Pin GPIO_PIN_13
#define THREE_CT_GPIO_Port GPIOB
#define TWO_CT_Pin GPIO_PIN_14
#define TWO_CT_GPIO_Port GPIOB
#define ONE_CT_Pin GPIO_PIN_15
#define ONE_CT_GPIO_Port GPIOB
#define ONE_IW_Pin GPIO_PIN_5
#define ONE_IW_GPIO_Port GPIOB
#define TWO_IW_Pin GPIO_PIN_6
#define TWO_IW_GPIO_Port GPIOB
#define THREE_IW_Pin GPIO_PIN_7
#define THREE_IW_GPIO_Port GPIOB
#define FOUR_IW_Pin GPIO_PIN_8
#define FOUR_IW_GPIO_Port GPIOB
#define FIVE_IW_Pin GPIO_PIN_9
#define FIVE_IW_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
